/****************************************Copyright (c)****************************************************
**                               Guangzou ZLG-MCU Development Co.,LTD.
**                                      graduate school
**                                 http://www.zlgmcu.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:           uart.h
** Last modified Date:  2011-7-6
** Last Version:        V1.0
** Descriptions:        uart的头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:          ZhenJinhong
** Created date:        2011-7-6
** Version:             V1.0
** Descriptions:        uart的头文件
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
** Rechecked by:
*********************************************************************************************************/
#ifndef __UART_H 
#define __UART_H

#define MODEM_TEST    0

#define IER_RBR     0x01
#define IER_THRE    0x02
#define IER_RLS     0x04

#define IIR_PEND    0x01
#define IIR_RLS     0x03
#define IIR_RDA     0x02
#define IIR_CTI     0x06
#define IIR_THRE    0x01

#define LSR_RDR     0x01
#define LSR_OE      0x02
#define LSR_PE      0x04
#define LSR_FE      0x08
#define LSR_BI      0x10
#define LSR_THRE    0x20
#define LSR_TEMT    0x40
#define LSR_RXFE    0x80

#define BUFSIZE     12


extern volatile uint8_t UART0TxEmpty, UART1TxEmpty;
extern volatile uint8_t UART2TxEmpty, UART3TxEmpty;
extern volatile uint8_t UART4TxEmpty;

extern uint8_t UART0Buffer[512],UART1Buffer[128],UART2Buffer[16], UART3Buffer[16], UART4Buffer[16];


/*********************************************************************************************************
** 函数名称：UARTInit
** 函数描述：串口初始化
** 输入参数：PortNum    UART端口号
**           bandrate   设定的串口波特率
** 返回值  ：无
*********************************************************************************************************/
uint32_t UARTInit( uint32_t portNum, uint32_t Baudrate );

/*********************************************************************************************************
** 函数名称：ModemInit
** 函数描述：Modem功能初始化（只有UART1拥有此功能）
** 输入参数：无
** 返回值  ：无
*********************************************************************************************************/
extern void ModemInit(uint32_t uiLocation );

/*********************************************************************************************************
** 函数名称：UART0_IRQHandler
** 函数描述：UART0中断处理函数
** 输入参数：无
** 返回值  ：无
*********************************************************************************************************/
extern void UART0_IRQHandler( void );

/*********************************************************************************************************
** 函数名称：UART1_IRQHandler
** 函数描述：UART1中断处理函数
** 输入参数：无
** 返回值  ：无
*********************************************************************************************************/
extern void UART1_IRQHandler( void );

/*********************************************************************************************************
** 函数名称：UART2_IRQHandler
** 函数描述：UART2中断处理函数
** 输入参数：无
** 返回值  ：无
*********************************************************************************************************/
extern void UART2_IRQHandler( void );

/*********************************************************************************************************
** 函数名称：UART3_IRQHandler
** 函数描述：UART3中断处理函数
** 输入参数：无
** 返回值  ：无
*********************************************************************************************************/
extern void UART3_IRQHandler( void );

/*********************************************************************************************************
** 函数名称：UART4_IRQHandler
** 函数描述：UART4中断处理函数
** 输入参数：无
** 返回值  ：无
*********************************************************************************************************/
extern void UART4_IRQHandler( void );

/*********************************************************************************************************
** 函数名称：UARTSend
** 函数描述：串口发送数据
** 输入参数：PortNum    UART端口号
**           BufferPtr  发送数据缓冲区
**           Length     发送数据长度
** 返回值  ：无
*********************************************************************************************************/
extern void UARTSend( uint32_t portNum, uint8_t *BufferPtr, uint32_t Length );


extern void UART_DMA_Send (uint8_t Channel,uint32_t uiNum);
extern void UART_DMA_Init(uint8_t CHnum);

#endif                                                                  /* end __UART_H                 */
/*********************************************************************************************************
**                            End Of File
*********************************************************************************************************/
